const faqs = {
    "hi": "Hello! How can I assist you today?",
    "how to reset my password": "You can reset your password by clicking on the 'Forgot Password' link on the login page.",
    "shipping time": "Shipping usually takes 3-5 business days, depending on your location.",
    "order status": "Please provide your order number to check the status.",
    "refund policy": "You can request a refund within 30 days of purchase. Please contact support for further assistance.",
    "support hours": "Our support team is available from 9 AM to 6 PM, Monday to Friday.",
    "how to contact support": "You can contact support via email at support@example.com or through the 'Talk to a Human' button.",
    "payment methods": "We accept payment via credit card, PayPal, and bank transfer.",
    "what is your return policy": "We accept returns within 30 days of purchase, provided the product is in its original condition.",
    "can i change my order": "You can change your order within 24 hours of placing it. Please contact our support team for assistance.",
    "how to track my order": "You can track your order by logging into your account and checking the 'Order History' section.",
    "how do i cancel my order": "To cancel your order, please contact support within 12 hours of placing it.",
    "how to update my account information": "You can update your account details from the 'Account Settings' page in your profile.",
    "how to delete my account": "To delete your account, please contact support. Please note that account deletion is permanent.",
    "what to do if my order is damaged": "If your order arrives damaged, please contact our support team immediately with a photo of the damaged item.",
    "is there a discount for new customers": "Yes, we offer a 10% discount for new customers. Use code NEW10 at checkout.",
    "how to use a discount code": "You can enter your discount code at checkout to apply the discount to your order.",
    "can i modify my shipping address after placing an order": "Unfortunately, we cannot change the shipping address after the order has been placed. Please double-check your address before confirming the order.",
    "is express shipping available": "Yes, we offer express shipping for an additional fee. You can select this option at checkout.",
    "where do you ship to": "We ship worldwide. Please check our shipping policy for more details on specific countries.",
    "can i get a gift card": "Yes, we offer gift cards. You can purchase them directly from our website.",
    "do you offer gift wrapping": "Yes, we offer gift wrapping for an additional fee. You can select this option during checkout.",
    "how do i unsubscribe from emails": "To unsubscribe from our emails, click the 'unsubscribe' link at the bottom of any email you receive from us.",
    "how do i reset my two-factor authentication": "If you're having trouble with two-factor authentication, please contact support to reset it.",
    "how do i report a bug": "If you encounter a bug, please contact our support team with detailed information about the issue, and we’ll investigate it.",
    "how do i give feedback": "We welcome your feedback! Please contact us via email or use the feedback form on our website.",
    "what is the warranty on your products": "Our products come with a 1-year warranty. Please check our warranty policy for more details."
};